"Part1" = "BAHASA MALAYSIA";
"Part2" = "APPLE INC. ";
"Part3" = "PERJANJIAN LESEN PERISIAN SHORTCUTS UNTUK iOS";
"Part4" = "SILA BACA PERJANJIAN LESEN PERISIAN (“LESEN”) INI DENGAN TELITI SEBELUM MENGGUNAKAN PERISIAN APPLE TERSEBUT. DENGAN MENGGUNAKAN PERISIAN APPLE TERSEBUT, ANDA BERSETUJU ANDA TERIKAT KEPADA TERMA-TERMA LESEN INI. SEKIRANYA ANDA TIDAK BERSETUJU DENGAN TERMA-TERMA LESEN INI, JANGAN PASANGKAN DAN/ATAU GUNAKAN PERISIAN TERSEBUT.";
"Part5" = "NOTA PENTING: Setakat mana perisian ini boleh digunakan untuk mengeluarkan semula, mengubahsuai, menerbit dan mengedarkan bahan-bahan, perisian ini adalah dilesenkan kepada anda hanya untuk pengeluaran semula, pengubahsuaian, penerbitan dan pengedaran bahan-bahan yang tidak dilindungi hak cipta, bahan-bahan yang anda memiliki hak ciptanya, atau bahan-bahan yang anda diberi kuasa atau kebenaran dari segi undang-undang untuk mengeluarkan semula, mengubahsuai, menerbit atau mengedar. Sekiranya anda tidak pasti tentang hak anda untuk menyalin, mengubahsuai, menerbit atau mengedar sebarang bahan, anda harus menghubungi penasihat undang-undang anda.";
"Part6" = "1. Am";
"Part7" = "A. Perisian Apple tersebut, dan sebarang perisian pihak ketiga, dokumentasi, antara muka-antara muka, kandungan, fon-fon dan sebarang data yang mengiringi Lesen ini sama ada dalam ingatan baca sahaja, sebarang media lain atau sebarang bentuk lain (secara kolektif, “Perisian Apple”) adalah dilesenkan, bukan dijualkan, kepada anda oleh Apple Inc. (“Apple”) hanya untuk penggunaan menurut terma-terma Lesen ini. Apple dan/atau pemberi-pemberi lesen Apple mengekalkan hak milik Perisian Apple tersebut dan menyimpan semua hak yang tidak diberikan kepada anda secara nyata. ";
"Part8" = "B. Apple, menurut budi bicaranya, mungkin akan menyediakan tatar atau kemas kini masa depan kepada Perisian Apple tersebut untuk peranti iOS berjenama Apple anda yang serasi. Penataran dan pengemaskinian Perisian Apple tersebut, jika ada, tidak semestinya merangkumi kesemua ciri perisian yang tersedia ada atau ciri baru yang dikeluarkan oleh Apple untuk model-model peranti iOS yang baru atau lain. Terma-terma Lesen ini akan mengawal sebarang tatar atau kemas kini perisian yang disediakan oleh Apple kepada produk Perisian Apple asal tersebut, melainkan tatar atau kemas kini sedemikian diiringi oleh satu lesen berasingan dan dalam keadaan tersebut anda bersetuju bahawa terma-terma lesen tersebut akan mengawal tatar atau kemas kini sedemikian.";
"Part9" = "2. Penggunaan-penggunaan Lesen yang Dibenarkan dan Pembatasan-pembatasan.";
"Part10" = "A. Lesen. Tertakluk kepada terma-terma dan syarat-syarat Lesen ini dan sepertimana yang dibenarkan oleh “Peraturan-peraturan Penggunaan Perkhidmatan-perkhidmatan dan Kandungan” yang ditetapkan dalam Terma-terma dan Syarat-syarat Perkhidmatan Apple Media (https://www.apple.com/legal/internet-services/itunes/) (“Peraturan Penggunaan”), melainkan anda memperoleh Perisian Apple tersebut seperti yang dinyatakan dalam Seksyen 2B, anda diberikan satu lesen terhad yang tidak boleh dipindah milik dan tidak eksklusif untuk memasang dan menggunakan Perisian Apple tersebut dalam sebarang peranti iOS berjenama Apple yang serasi yang anda memiliki atau mengawal. Anda tidak boleh mengedarkan atau menyebabkan Perisian Apple tersebut menjadi tersedia melalui rangkaian di mana Perisian Apple tersebut boleh dijalankan oleh berbilang peranti pada masa yang sama. Anda tidak boleh menyewa, memajak, meminjam, menjual, mengedarkan semula atau memberi sub-lesen kepada Perisian Apple tersebut.";
"Part11" = "B. Lesen Pukal atau Penyelenggaraan. Sekiranya anda memperoleh Perisian Apple tersebut di bawah suatu program lesen pukal atau penyelenggaraan daripada Apple, terma-terma lesen pukal atau penyelenggaraan anda akan menentukan bilangan salinan Perisian Apple tersebut yang anda dibenarkan untuk memuat turun, memasang, mengguna dan menjalankan pada peranti-peranti iOS berjenama Apple yang anda memiliki atau mengawal. Melainkan sebagaimana yang dipersetujui secara bertulis oleh Apple, semua terma dan syarat lain Lesen ini hendaklah terpakai kepada penggunaan anda berkenaan Perisian Apple tersebut yang diperoleh di bawah suatu lesen pukal atau penyelenggaraan.";
"Part12" = "C. Keperluan-keperluan Sistem. Perisian Apple hanya disokong dalam perkakasan berjenama Apple yang memenuhi keperluan-keperluan sistem tertentu seperti yang dinyatakan oleh Apple.";
"Part13" = "D. Kandungan dan Bahan-bahan Digital. Hak milik dan hak-hak harta intelek dalam dan kepada sebarang kandungan, termasuk cap dagang-cap dagang, logo-logo dan imej-imej, yang dipaparkan oleh atau yang diakses melalui Perisian Apple tersebut adalah kepunyaan pemilik kandungan masing-masing. Kandungan sedemikian mungkin dilindungi oleh hak cipta, cap dagang atau undang-undang harta intelek dan triti-triti lain, dan mungkin tertakluk kepada terma-terma penggunaan pihak ketiga yang menyediakan kandungan sedemikian. Melainkan sepertimana yang diperuntukkan dalam Lesen ini, (i) Lesen ini tidak memberi anda sebarang hak untuk mengguna kandungan sedemikian, serta tidak memberi sebarang jaminan bahawa kandungan tersebut akan terus tersedia untuk anda dan (ii) anda dilarang mengguna, mengekstrak atau mengedar, sama ada secara komersial atau selainnya, atas dasar kendiri, sebarang gambar, logo, teks, kod, imej, grafik, hasil seni, audio, video atau aset yang serupa (“Bahan Digital”) yang terkandung dalam, atau tersedia sebagai sebahagian daripada, Perisian Apple tersebut, atau selainnya menggunakan Bahan Digital tersebut di luar konteks tujuan penggunaannya yang diniatkan untuk digunakan sebagai sebahagian Perisian Apple tersebut.";
"Part14" = "E. Penggunaan Shortcuts. Anda mengaku bahawa semua pintasan aplikasi dan/atau laman web (“Shortcuts”) adalah sepenuhnya tanggungjawab pihak atau pihak-pihak yang mewujudkan Shortcuts sedemikian. Apple tidak mempunyai kawalan ke atas, dan tidak menanggung sebarang tanggungjawab untuk, kandungan atau kefungsian sebarang Shortcut pihak ketiga. Risiko menggunakan sebarang Shortcut ditanggung anda sendiri dan anda bertanggungjawab sepenuhnya untuk pematuhan anda kepada sebarang terma atau perjanjian pihak ketiga yang timbul daripada penggunaan sebarang Shortcut oleh anda. Anda mengaku bahawa Apple tidak mempunyai kewajipan untuk pra-periksa Shortcuts, walaupun Apple menyimpan hak dalam budi bicara tunggalnya untuk pra-periksa, menolak, melucutkan atau melumpuhkan sebarang Shortcuts. ";
"Part15" = "F. Pengongsian Shortcuts. Perisian Apple tersebut mungkin membolehkan anda berkongsi Shortcuts yang anda hasilkan dengan orang lain melalui suatu pautan web. Shortcut terkongsi anda, serta sebarang kandungan yang terbenam dalamnya, akan disimpan pada pelayan-pelayan Apple untuk tujuan membolehkan pengongsian sedemikian dan mungkin digunakan secara umum untuk memperbaik produk-produk dan perkhidmatan-perkhidmatan Apple. Shortcut terkongsi anda, serta sebarang kandungan yang terbenam dalamnya, akan tersedia kepada sesiapa yang mempunyai akses kepada pautan web tersebut, dan mereka kemudiannya boleh menyalin, menyimpan, mengubahsuai dan mengedarkan semula satu salinan Shortcut anda dan semua kandungan yang terbenam dalamnya. Dengan mengongsi suatu Shortcut, anda mewakili bahawa: (1) anda mempunyai semua hak dan lesen yang diperlukan kepada Shortcut sedemikian dan bahawa Shortcut tersebut tidak melanggar atau menyalahi hak-hak sebarang pihak lain; dan (2) sebarang Shortcut yang anda berkongsi tidak akan melanggar sebarang undang-undang, menyumbang kepada atau menggalakkan kelakuan yang melanggar atau selainnya menyalahi undang-undang, atau selainnya bersifat lucah atau tidak menyenangkan. Anda mengaku bahawa Apple tidak mempunyai kewajipan untuk mengkaji semula sebarang Shortcuts yang anda berkongsi, walaupun Apple menyimpan hak dalam budi bicara tunggalnya untuk mengkaji semula, melucutkan atau melumpuhkan sebarang Shortcuts yang anda kongsikan.";
"Part16" = "G. Pembatasan-pembatasan Penggunaan. Anda bersetuju untuk tidak: memuat naik, mengepos, mengirim e-mel, menyampai, mengongsi atau selainnya menyediakan sebarang Shortcut yang: (1) menyalahi undang-undang, bersifat tort, memfitnah, bersifat kesat, bersifat lucah, mengandungi libel, atau menyinggung mana-mana kaum atau etnik, atau selainnya tidak menyenangkan; (2) melanggar, atau menggalakkan sebarang kelakuan yang akan melanggar, sebarang undang-undang atau peraturan terpakai atau yang akan menimbulkan liabiliti sivil; (3) menggalakkan diskriminasi, ketaksuban, rasisme, kebencian, penggangguan atau kemudaratan terhadap mana-mana individu atau kumpulan; (4) bersifat ganas atau mengugut, atau menggalakkan keganasan atau tindakan-tindakan yang mengugut mana-mana orang lain; (5) menggalakkan aktiviti-aktiviti yang menyalahi undang-undang atau memudaratkan; atau (6) anda tahu atau percaya adalah palsu, memperdayakan, melibatkan penipuan, atau dalam sebarang cara mengelirukan seseorang pengguna Shortcut sedemikian. Anda bersetuju selanjutnya untuk tidak mengganggu, menggendalakan, atau menyebabkan suatu beban tidak wajar ke atas pelayan-pelayan atau rangkaian-rangkaian yang berhubung dengan Perisian Apple tersebut atau sebarang aplikasi perisian, perkhidmatan atau laman web pihak ketiga pada peranti iOS anda (“Aplikasi Pihak Ketiga”) atau melanggar peraturan-peraturan, dasar-dasar atau prosedur-prosedur rangkaian-rangkaian sedemikian atau Aplikasi Pihak Ketiga.";
"Part17" = "H. Aplikasi Pihak Ketiga. Untuk melengkapkan Shortcuts tertentu, Perisian Apple tersebut mungkin memerlukan akses kepada Aplikasi Pihak Ketiga tertentu. Anda secara nyata memberi kebenaran dan memberi kuasa kepada Perisian Apple tersebut untuk mengakses dan mengguna Aplikasi Pihak Ketiga ini bagi pihak anda setakat mana yang diperlukan untuk melengkapkan Shortcut tersebut dengan Perisian Apple tersebut. Setakat mana Perisian Apple tersebut mengakses sebarang Aplikasi Pihak Ketiga, Apple tidak mempunyai kewajipan nyata atau tersirat untuk menyediakan sebarang sokongan teknikal atau sokongan lain untuk Aplikasi Pihak Ketiga sedemikian. Sila hubungi penjual perisian, pengilang atau pembekal perkhidmatan yang sewajarnya secara langsung untuk sokongan teknikal dan perkhidmatan pelanggan yang berkaitan dengan perisiannya, perkhidmatannya, laman webnya dan/atau produk-produknya. ANDA BERSETUJU SELANJUTNYA BAHAWA ANDA TERIKAT KEPADA, DAN BERSETUJU UNTUK MEMATUHI, SEMUA TERMA PERKHIDMATAN TERPAKAI ATAU PERJANJIAN LAIN UNTUK APLIKASI PIHAK KETIGA SEDEMIKIAN SEMASA MENGGUNAKAN PERISIAN APPLE TERSEBUT. ANDA BERTANGGUNGJAWAB SEPENUHNYA UNTUK MEMASTIKAN BAHAWA SEMUA SHORTCUTS MEMATUHI DENGAN TERMA-TERMA TERPAKAI UNTUK SETIAP APLIKASI PIHAK KETIGA YANG DIGUNAKAN OLEH SHORTCUT TERSEBUT. APPLE TIDAK MEMBERI SEBARANG JAMINAN WALAU APA CARA PUN BAHAWA SHORTCUTS MEMATUHI TERMA-TERMA UNTUK SEBARANG APLIKASI PIHAK KETIGA DAN APPLE TIDAK BERTANGGUNGJAWAB UNTUK SEBARANG SHORTCUTS PIHAK KETIGA.";
"Part18" = "I. Kejuruteraan Undur (Reverse Engineering) Dilarangkan. Anda tidak boleh, dan anda bersetuju untuk tidak, atau untuk tidak membolehkan orang lain untuk, menyalin (melainkan sepertimana yang dibenarkan secara nyata oleh Lesen ini atau Peraturan Penggunaan jika mereka terpakai kepada anda), menyahsusun, melakukan kejuruteraan undur (reverse engineer), menyahhimpun, mencuba memperoleh kod sumber, menyahsulitkan, mengubah, atau menghasilkan karya-karya terbitan berdasarkan Perisian Apple tersebut atau sebarang perkhidmatan yang disediakan oleh Perisian Apple tersebut, atau mana-mana bahagian daripadanya (melainkan sebagaimana dan hanya setakat mana-mana pembatasan terdahulu dilarang oleh undang-undang terpakai atau setakat mana yang mungkin dibenarkan oleh terma-terma lesen yang mengawal penggunaan komponen-komponen sumber terbuka yang termasuk bersama Perisian Apple tersebut). ";
"Part19" = "J. Pematuhan Undang-Undang. Anda bersetuju untuk mengguna Perisian Apple dan Perkhidmatan tersebut (seperti yang didefinisikan dalam Seksyen 4 di bawah) dengan cara yang mematuhi semua undang-undang terpakai, termasuk undang-undang tempatan negara atau rantau di mana anda menetap atau di mana anda memuat turun atau mengguna Perisian Apple dan Perkhidmatan tersebut. ";
"Part20" = "K. Kemas Kini Automatik. Sekiranya anda memilih untuk membenarkan pengemaskinian aplikasi automatik, peranti anda akan secara berkala memeriksa dengan Apple untuk kemas kini dan tatar kepada Perisian Apple tersebut dan, jika suatu kemas kini atau tatar adalah tersedia, kemas kini atau tatar tersebut akan dimuat turun dan dipasangkan secara automatik pada peranti anda dan, jika berkenaan, peranti-peranti persisian anda. Anda boleh matikan pengemaskinian aplikasi automatik tersebut sama sekali pada bila-bila masa dengan menukar tetapan pengemaskinian aplikasi automatik yang boleh ditemui dalam Tetapan (Settings).";
"Part21" = "3. Kebenaran untuk Menggunakan Data. ";
"Part22" = "A. Data Analitis. Sekiranya anda memilih untuk membenarkan pengumpulan Analitis, anda bersetuju bahawa Apple dan anak syarikat-anak syarikatnya dan ejen-ejennya boleh mengumpulkan, mengekalkan, memproseskan dan menggunakan maklumat diagnostik, maklumat teknikal, maklumat penggunaan dan maklumat berkaitan, termasuk tetapi tidak terhad kepada pengenalpasti-pengenalpasti sistem atau perkakasan unik, maklumat berkenaan peranti iOS, komputer, perisian sistem dan aplikasi, dan alat-alat persisian anda, yang dikumpulkan dari semasa ke semasa untuk menyediakan dan memperbaik produk-produk dan perkhidmatan-perkhidmatan Apple, memudahkan peruntukan pengemaskinian perisian, sokongan produk dan perkhidmatan-perkhidmatan lain kepada anda (jika ada) yang berkenaan dengan Perisian Apple tersebut, dan untuk mengesahkan pematuhan kepada terma-terma Lesen ini. Apple boleh menggunakan maklumat ini, dengan syarat maklumat ini dikumpulkan dalam bentuk yang tidak mengenalpastikan anda secara peribadi, untuk tujuan-tujuan yang dinyatakan di atas. Untuk membolehkan rakan-rakan kongsi Apple dan pembangun-pembangun pihak ketiga memperbaik perisian, perkakasan dan perkhidmatan-perkhidmatan mereka yang direka untuk digunakan bersama produk-produk Apple, Apple juga boleh membekalkan mana-mana rakan kongsi atau pembangun pihak ketiga sedemikian dengan suatu subset maklumat diagnostik yang relevan kepada perisian, perkakasan dan/atau perkhidmatan-perkhidmatan rakan kongsi atau pembangun tersebut, selagi maklumat diagnostik tersebut adalah dalam bentuk yang tidak mengenalpastikan anda secara peribadi.";
"Part23" = "B. Data Lokasi. Apple dan rakan-rakan kongsinya, pemegang-pemegang lesennya dan pembangun-pembangun pihak ketiganya mungkin menyediakan perkhidmatan-perkhidmatan tertentu melalui Perisian Apple tersebut yang bergantung kepada maklumat lokasi. Untuk menyediakan dan memperbaik perkhidmatan-perkhidmatan tersebut, sekiranya ada, Apple dan rakan-rakan kongsinya, pemegang-pemegang lesennya dan pembangun-pembangun pihak ketiganya mungkin menghantar, mengumpul, mengekal, memproses dan mengguna data lokasi anda. Data lokasi dan pertanyaan yang dikumpul oleh Apple adalah dikumpulkan dalam bentuk yang tidak mengenalpastikan anda secara peribadi dan boleh digunakan oleh Apple dan rakan-rakan kongsinya, pemegang-pemegang lesennya dan pembangun-pembangun pihak ketiganya untuk menyediakan dan memperbaik produk-produk dan perkhidmatan-perkhidmatan berdasarkan lokasi. Dengan menggunakan sebarang perkhidmatan berdasarkan lokasi yang disediakan oleh atau melalui Perisian Apple tersebut, anda bersetuju dan membenarkan Apple dan rakan-rakan kongsinya, pemegang-pemegang lesennya dan pembangun-pembangun pihak ketiganya menyampai, mengumpul, mengekal, memproses dan mengguna data lokasi dan pertanyaan anda bagi menyediakan dan memperbaik produk-produk dan perkhidmatan-perkhidmatan sedemikian. Anda boleh menarik balik kebenaran ini pada bila-bila masa dengan menuju ke tetapan Perkhidmatan Lokasi pada peranti iOS anda dan sama ada matikan tetapan Perkhidmatan Lokasi global atau matikan tetapan lokasi individu bagi Perisian Apple tersebut. Apabila menggunakan aplikasi-aplikasi atau perkhidmatan-perkhidmatan pihak ketiga pada peranti iOS tersebut yang menggunakan atau menyediakan data lokasi, anda adalah tertakluk kepada dan harus merujuk terma-terma dan dasar privasi pihak ketiga sedemikian berkenaan penggunaan data lokasi oleh aplikasi-aplikasi atau perkhidmatan-perkhidmatan pihak ketiga sedemikian.";
"Part24" = "C. Dasar Privasi. Pada sepanjang masa, maklumat anda akan dikendalikan mengikut Dasar Privasi Apple, yang boleh dilihat di: https://www.apple.com/legal/privacy/. ";
"Part25" = "4. Perkhidmatan-Perkhidmatan dan Bahan-Bahan Pihak Ketiga.";
"Part26" = "A. Am. Perisian Apple tersebut membolehkan akses kepada iTunes Store Apple, App Store, iCloud, Maps dan perkhidmatan-perkhidmatan dan laman web-laman web Apple dan pihak ketiga lain (secara kolektif dan individu, “Perkhidmatan”). Perkhidmatan sedemikian mungkin tidak tersedia dalam semua bahasa atau semua negara. Penggunaan Perkhidmatan ini memerlukan akses Internet dan penggunaan Perkhidmatan tertentu mungkin memerlukan Apple ID, mungkin memerlukan anda menerima terma-terma tambahan dan mungkin tertakluk kepada yuran-yuran tambahan. Dengan menggunakan perisian ini berhubungan dengan suatu akaun iTunes Store, Apple ID atau Perkhidmatan Apple lain, anda bersetuju kepada terma-terma perkhidmatan yang terpakai untuk Perkhidmatan tersebut, seperti Terma-terma dan Syarat-syarat Perkhidmatan Apple Media terkini yang anda boleh mengakses dan merujuk di https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. Sekiranya anda memilih untuk menggunakan perkhidmatan iCloud melalui Perisian Apple tersebut, penggunaan sedemikian adalah tertakluk kepada terma-terma tambahan berikut: Terma-terma dan Syarat-syarat iCloud yang boleh didapati di https://www.apple.com/legal/internet-services/icloud/ dan Dasar Privasi Apple yang boleh didapati di https://www.apple.com/legal/privacy/.";
"Part28" = "C. Anda memahami bahawa dengan menggunakan mana-mana Perkhidmatan, anda mungkin berhadapan dengan kandungan yang mungkin dianggap menjelikkan, tidak senonoh, atau tidak menyenangkan, yang kandungannya mungkin atau tidak mungkin dikenal pasti mengandungi bahasa kesat. Walau bagaimanapun, anda bersetuju untuk menanggung segala risiko berkenaan penggunaan Perkhidmatan tersebut dan Apple tidak akan bertanggungjawab terhadap anda untuk kandungan yang didapati menjelikkan, tidak senonoh atau tidak menyenangkan.";
"Part29" = "D. Perkhidmatan tertentu mungkin memaparkan, termasuk atau menyediakan perkhidmatan-perkhidmatan, kandungan, data, maklumat, aplikasi-aplikasi atau bahan-bahan daripada pihak-pihak ketiga (“Bahan Pihak Ketiga”) atau menyediakan pautan-pautan kepada laman web-laman web pihak ketiga atau aplikasi-aplikasi tertentu. Dengan menggunakan Perkhidmatan tersebut, anda mengaku dan bersetuju bahawa Apple tidak bertanggungjawab untuk memeriksa atau menilai kandungan, ketepatan, kelengkapan, kekinian, kesahihan, pematuhan hak cipta, kesahan, kesopanan, kualiti atau mana-mana aspek lain Bahan Pihak Ketiga, aplikasi-aplikasi atau laman web-laman web sedemikian. Apple, kakitangannya, pihak-pihak berkaitannya dan anak syarikat-anak syarikatnya tidak menjamin atau menyokong dan tidak menerima dan tidak akan mempunyai sebarang liabiliti atau tanggungjawab terhadap anda atau sesiapa orang lain untuk sebarang Perkhidmatan pihak ketiga, Bahan Pihak Ketiga, aplikasi-aplikasi atau laman web-laman web, atau untuk sebarang bahan, produk, atau perkhidmatan lain pihak-pihak ketiga. Bahan Pihak Ketiga dan pautan-pautan kepada laman web-laman web lain adalah disediakan hanya untuk kesenangan anda.";
"Part30" = "E. Setakat mana yang anda memuat naik sebarang kandungan dengan menggunakan Perkhidmatan tersebut, anda mewakili bahawa anda memiliki kesemua hak dalam, atau mempunyai kebenaran atau selainnya dibenarkan di sisi undang-undang untuk memuat naik kandungan sedemikian dan bahawa kandungan sedemikian tidak melanggar sebarang terma perkhidmatan yang terpakai kepada Perkhidmatan tersebut. Anda bersetuju bahawa Perkhidmatan tersebut mengandungi kandungan, maklumat dan bahan proprietari, termasuk tetapi tidak terhad kepada sebarang Bahan Digital, yang dimiliki oleh Apple, pemilik laman dan/atau pemberi-pemberi lesen mereka, dan dilindungi oleh undang-undang harta intelek dan undang-undang lain yang terpakai, termasuk tetapi tidak terhad kepada hak cipta. Anda bersetuju bahawa anda tidak akan mengguna kandungan, maklumat atau bahan-bahan proprietari sedemikian selain daripada penggunaan Perkhidmatan tersebut yang dibenarkan, atau dalam sebarang cara yang bercanggah dengan terma-terma Lesen ini atau yang melanggar sebarang hak harta intelek pihak ketiga atau Apple. Kesemua bahagian Perkhidmatan tersebut tidak boleh dihasilkan semula dalam sebarang bentuk atau dalam sebarang cara. Anda bersetuju untuk tidak mengubahsuai, menyewa, memajak, meminjamkan, menjual, mengedar, atau menghasilkan karya-karya terbitan berdasarkan Perkhidmatan tersebut, dalam sebarang cara, dan anda tidak boleh mengeksploit Perkhidmatan tersebut dalam sebarang cara yang tidak dibenarkan, termasuk tetapi tidak terhad kepada, menggunakan Perkhidmatan tersebut untuk menghantar sebarang virus komputer, cecacing, kuda-kuda Troy atau perisian hasad lain, atau menceroboh atau membebani kapasiti rangkaian. Anda bersetuju selanjutnya untuk tidak menggunakan Perkhidmatan tersebut dalam sebarang cara yang menganggu, menyalahguna, menghendap, mengancam, memfitnah atau selainnya melanggar atau mencabul hak-hak mana-mana pihak lain, dan bahawa Apple tidak bertanggungjawab dalam sebarang cara untuk sebarang penggunaan sedemikian oleh anda, atau untuk sebarang mesej atau penyampaian yang mengganggu, mengancam, memfitnah, menjelikkan, atau mesej-mesej atau penyampaian-penyampaian yang melanggar atau menyalahi undang-undang yang anda mungkin terima sebagai akibat mengguna mana-mana Perkhidmatan tersebut.";
"Part31" = "F. Selanjutnya, Perkhidmatan dan Bahan Pihak Ketiga yang mungkin diakses, dipautkan kepada atau dipaparkan melalui Perisian Apple tersebut tidak tersedia dalam semua bahasa atau semua negara atau rantau. Apple tidak membuat representasi bahawa Perkhidmatan dan Bahan Pihak Ketiga sedemikian adalah bersesuaian atau tersedia ada untuk digunakan di mana-mana lokasi tertentu. Setakat mana anda memilih untuk menggunakan atau mengakses Perkhidmatan dan Bahan Pihak Ketiga sedemikian, anda berbuat demikian atas inisiatif anda sendiri dan anda bertanggungjawab untuk pematuhan dengan sebarang undang-undang terpakai, termasuk tetapi tidak terhad kepada undang-undang tempatan dan undang-undang privasi dan pengumpulan data. Apple dan pemberi-pemberi lesennya menyimpan hak untuk mengubahkan, menggantungkan, melucutkan, atau melumpuhkan akses kepada mana-mana Perkhidmatan pada bila-bila masa tanpa notis. Dalam apa jua keadaan, Apple tidak akan bertanggungjawab untuk perlucutan atau kelumpuhan akses kepada mana-mana Perkhidmatan sedemikian. Apple juga boleh mengehadkan penggunaan atau akses kepada Perkhidmatan tertentu, dalam sebarang kes dan tanpa notis atau liabiliti.";
"Part32" = "5. Penamatan. Lesen ini adalah efektif sehingga ditamatkan. Hak-hak anda di bawah Lesen ini akan ditamatkan secara automatik atau selainnya berhenti menjadi efektif tanpa notis daripada Apple jika anda gagal untuk mematuhi mana-mana terma(-terma) Lesen ini. Sebaik sahaja Lesen ini tamat, anda mesti hentikan semua penggunaan Perisian Apple tersebut dan musnahkan semua salinan Perisian Apple tersebut, sama ada salinan penuh atau separa. Seksyen-seksyen 2I, 3, 4, 5, 6, 7, 8, 10 dan 11 Lesen ini akan terus berkuatkuasa selepas sebarang penamatan sedemikian.";
"Part33" = "6. Penolakan Tuntutan Waranti-waranti. ";
"Part34" = "A. Sekiranya anda adalah seorang pelanggan yang merupakan seorang pengguna (seseorang yang menggunakan Perisian Apple tersebut di luar bidang perdagangan, perniagaan atau profesion anda), anda mungkin mempunyai hak-hak dari segi undang-undang dalam negara di mana anda menetap yang melarang had-had berikut daripada terpakai kepada anda, dan di mana had-had tersebut dilarang, had-had tersebut tidak akan terpakai kepada anda. Untuk mengetahui lebih lanjut tentang hak-hak pengguna, anda seharusnya menghubungi suatu organisasi penasihat pengguna tempatan.";
"Part35" = "B. ANDA MENGAKU DAN BERSETUJU SECARA NYATA BAHAWA, SETAKAT YANG DIBENARKAN OLEH UNDANG-UNDANG TERPAKAI, RISIKO MENGGUNAKAN PERISIAN APPLE TERSEBUT DAN SEBARANG PERKHIDMATAN YANG DILAKSANAKAN OLEH ATAU DIAKSES MELALUI PERISIAN APPLE TERSEBUT, DITANGGUNG ANDA SENDIRI DAN BAHAWA SEGALA RISIKO BERKENAAN KEPUASAN KUALITI, PRESTASI, KETEPATAN DAN USAHA DITANGGUNG OLEH ANDA. ";
"Part36" = "C. SETAKAT MAKSIMUM YANG DIBENARKAN OLEH UNDANG-UNDANG TERPAKAI, PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT ADALAH DISEDIAKAN “SEPERTI DIDAPATI” (AS IS), DAN “SEPERTI TERSEDIA” (AS AVAILABLE), DENGAN SEGALA KEROSAKAN DAN TANPA WARANTI APA JENIS SEKALIPUN, DAN APPLE SERTA PEMBERI-PEMBERI LESEN APPLE (SECARA KOLEKTIF DIRUJUK SEBAGAI “APPLE” UNTUK TUJUAN SEKSYEN-SEKSYEN 6 DAN 7) DENGAN INI MENOLAK TUNTUT SEMUA WARANTI DAN SYARAT BERKENAAN DENGAN PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT, SAMA ADA SECARA NYATA, TERSIRAT ATAU STATUTORI, TERMASUK, TETAPI TIDAK TERHAD KEPADA, WARANTI-WARANTI TERSIRAT DAN/ATAU SYARAT-SYARAT MENGENAI KEBOLEHDAGANGAN, KEPUASAN KUALITI, KESESUAIAN UNTUK SEBARANG TUJUAN TERTENTU, KETEPATAN, KENIKMATAN AMAN SENTOSA, DAN KETIADAAN PERLANGGARAN HAK-HAK PIHAK KETIGA. ";
"Part37" = "D. APPLE TIDAK MENJAMIN BAHAWA TIDAK AKAN ADA SEBARANG GANGGUAN TERHADAP PENGGUNAAN PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT OLEH ANDA, BAHAWA KEFUNGSIAN-KEFUNGSIAN YANG TERKANDUNG DALAM, ATAU PERKHIDMATAN-PERKHIDMATAN YANG DILAKSANAKAN ATAU DISEDIAKAN OLEH, PERISIAN APPLE TERSEBUT AKAN MEMENUHI KEPERLUAN-KEPERLUAN ANDA, BAHAWA PENGOPERASIAN PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT TIDAK AKAN DIGANGGU ATAU BEBAS DARIPADA RALAT, BAHAWA SEBARANG PERKHIDMATAN AKAN TERUS TERSEDIA, BAHAWA PERISIAN APPLE ATAU PERKHIDMATAN-PERKHIDMATAN TERSEBUT AKAN DIPERBETULKAN, ATAU BAHAWA PERISIAN APPLE TERSEBUT AKAN SERASI ATAU BERFUNGSI DENGAN MANA-MANA PERISIAN PIHAK KETIGA, APLIKASI ATAU PERKHIDMATAN PIHAK KETIGA. PEMASANGAN PERISIAN APPLE INI MUNGKIN MENJEJASKAN KETERSEDIAAN DAN KEBOLEHGUNAAN PERISIAN PIHAK KETIGA, APLIKASI-APLIKASI ATAU PERKHIDMATAN-PERKHIDMATAN PIHAK KETIGA, SERTA PRODUK-PRODUK DAN PERKHIDMATAN-PERKHIDMATAN APPLE.";
"Part38" = "E. ANDA SELANJUTNYA MENGAKU BAHAWA PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT TIDAK DINIATKAN ATAU SESUAI UNTUK DIGUNAKAN DALAM SITUASI-SITUASI ATAU PERSEKITARAN-PERSEKITARAN DI MANA KEGAGALAN ATAU KELEWATAN MASA, ATAU RALAT-RALAT ATAU KETIDAKTEPATAN DALAM KANDUNGAN, DATA ATAU MAKLUMAT YANG DISEDIAKAN OLEH, PERISIAN APPLE ATAU PERKHIDMATAN-PERKHIDMATAN TERSEBUT BOLEH MENYEBABKAN MAUT, KECEDERAAN DIRI, ATAU KEROSAKAN FIZIKAL ATAU ALAM SEKITAR YANG TERUK, TERMASUK, TANPA HAD, PENGOPERASIAN KEMUDAHAN NUKLEAR, SISTEM-SISTEM PANDU ARAH ATAU KOMUNIKASI PESAWAT UDARA, KAWALAN LALU LINTAS UDARA, SISTEM-SISTEM SOKONGAN HIDUP ATAU SISTEM-SISTEM SENJATA. ";
"Part39" = "F. TIADA MAKLUMAT LISAN ATAU BERTULIS ATAU MAKLUMAN YANG DIBERIKAN OLEH APPLE ATAU MANA-MANA WAKIL APPLE YANG SAH AKAN MEWUJUDKAN SEBARANG WARANTI. SEKIRANYA PERISIAN APPLE ATAU PERKHIDMATAN-PERKHIDMATAN TERSEBUT TERBUKTI ROSAK, ANDA AKAN MENANGGUNG SEGALA KOS PERKHIDMATAN, PEMBAIKAN ATAU PEMBETULAN YANG DIPERLUKAN. SESETENGAH BIDANG KUASA TIDAK MEMBENARKAN PENGECUALIAN WARANTI-WARANTI TERSIRAT ATAU PENGEHADAN HAK-HAK STATUTORI TERPAKAI SESEORANG PENGGUNA, OLEH ITU, PENGECUALIAN DAN HAD-HAD TERSEBUT MUNGKIN TIDAK TERPAKAI KEPADA ANDA.";
"Part40" = "7. Pembatasan Liabiliti. SETAKAT MANA TIDAK DILARANG OLEH UNDANG-UNDANG TERPAKAI, APPLE DALAM APA JUA KEADAAN TIDAK AKAN MENANGGUNG LIABILITI UNTUK KECEDERAAN DIRI, ATAU APA JUA GANTI RUGI SAMPINGAN, KHAS, TIDAK LANGSUNG ATAU BERBANGKIT, TERMASUK TANPA HAD, GANTI RUGI UNTUK KEHILANGAN KEUNTUNGAN, KEROSAKAN ATAU KEHILANGAN DATA, KEGAGALAN UNTUK MENYAMPAIKAN ATAU MENERIMA SEBARANG DATA, GANGGUAN PERNIAGAAN ATAU SEBARANG GANTI RUGI ATAU KERUGIAN KOMERSIAL LAIN, YANG TIMBUL DARIPADA ATAU BERKENAAN DENGAN PENGGUNAAN PERISIAN APPLE DAN PERKHIDMATAN-PERKHIDMATAN TERSEBUT ATAU SEBARANG PERISIAN PIHAK KETIGA ATAU APLIKASI BERHUBUNGAN DENGAN PERISIAN APPLE ATAU PERKHIDMATAN-PERKHIDMATAN TERSEBUT OLEH ANDA ATAU KETIDAKUPAYAAN ANDA UNTUK MENGGUNAKANNYA, WALAU APA SEBABNYA, TANPA MENGHIRAUKAN TEORI LIABILITI (KONTRAK, TORT ATAU SELAINNYA) DAN WALAUPUN JIKA APPLE TELAH DIMAKLUMKAN TENTANG KEMUNGKINAN GANTI RUGI SEDEMIKIAN. SESETENGAH BIDANG KUASA TIDAK MEMBENARKAN PENGECUALIAN ATAU PEMBATASAN LIABILITI UNTUK KECEDERAAN DIRI, ATAU GANTI RUGI SAMPINGAN ATAU BERBANGKIT, OLEH YANG DEMIKIAN, PEMBATASAN INI MUNGKIN TIDAK TERPAKAI KEPADA ANDA. Dalam apa jua keadaan, jumlah liabiliti Apple kepada anda secara keseluruhannya untuk semua ganti rugi (melainkan sepertimana yang diperuntukkan dalam undang-undang berkenaan kes-kes yang melibatkan kecederaan diri) tidak akan melebihi amaun lima puluh dolar ($50.00). Had-had yang tersebut di atas akan terpakai walaupun sekiranya remedi yang dinyatakan di atas gagal akan tujuan utamanya.";
"Part41" = "8. Pengawalan Eksport. Anda tidak boleh mengguna atau selainnya mengeksport atau mengeksport semula Perisian Apple tersebut kecuali sebagaimana dibenarkan oleh undang-undang Amerika Syarikat dan undang-undang dalam bidang kuasa(-bidang kuasa) di mana Perisian Apple tersebut diperoleh. Khususnya, tetapi tanpa had, Perisian Apple tersebut tidak boleh dieksport atau dieksportkan semula (a) ke dalam mana-mana negara yang dilarang untuk berdagang dengan Amerika Syarikat atau (b) kepada sesiapa yang tersenarai dalam Senarai Warganegara Ditentukan Khas (Specially Designated Nationals) Jabatan Perbendaharaan Amerika Syarikat atau Senarai Orang Terhalang atau Entiti Terhalang (Denied Person’s List or Entity List) Jabatan Perdagangan Amerika Syarikat atau mana-mana senarai pihak terlarang lain. Dengan menggunakan Perisian Apple tersebut, anda mewakilkan dan menjamin bahawa anda tidak berada dalam mana-mana negara sedemikian atau mana-mana senarai sebegitu. Anda juga bersetuju bahawa anda tidak mengguna Perisian Apple tersebut untuk sebarang tujuan yang dilarang oleh undang-undang Amerika Syarikat, termasuk tanpa had, pembangunan, perekaan, penghasilan atau pengeluaran senjata-senjata peluru berpandu, nuklear, kimia atau biologi.";
"Part42" = "9. Pengguna-pengguna Akhir Kerajaan. Perisian Apple tersebut dan dokumentasi berkaitan adalah “Item Komersial” sepertimana terma tersebut didefinisikan dalam 48 C.F.R. §2.101, yang mengandungi “Perisian Komputer Komersial” dan “Dokumentasi Perisian Komputer Komersial” sepertimana terma-terma tersebut digunakan dalam 48 C.F.R. §12.212 atau 48 C.F.R. §227.7202, yang mana terpakai. Selaras dengan 48 C.F.R. §12.212 atau 48 C.F.R. §227.7202-1 hingga 227.7202-4, yang mana terpakai, Perisian Komputer Komersial dan Dokumentasi Perisian Komputer Komersial adalah dilesenkan kepada pengguna-pengguna akhir Kerajaan Amerika Syarikat (a) hanya sebagai Item-item Komersial dan (b) hanya dengan hak-hak tersebut seperti yang diberikan kepada semua pengguna akhir lain menurut terma-terma dan syarat-syarat yang dinyatakan di sini. Hak-hak yang tidak diterbitkan disimpan di bawah undang-undang hak cipta Amerika Syarikat. ";
"Part43" = "10. Undang-undang yang Mengawal dan Kebolehasingan. Lesen ini akan dikawal oleh dan ditafsirkan mengikut undang-undang Negeri California, tidak termasuk prinsip-prinsip konflik undang-undangnya. Lesen ini tidak akan dikawal oleh Konvensyen Pertubuhan Bangsa-bangsa Bersatu berkenaan Kontrak-kontrak untuk Jualan Barangan Antarabangsa, yang pemakaiannya dikecualikan secara nyata. Sekiranya anda adalah seorang pengguna yang menetap di United Kingdom, Lesen ini akan dikawal oleh undang-undang dalam bidang kuasa tempat kediaman anda. Sekiranya mahkamah yang mempunyai bidang kuasa kompeten mendapati mana-mana peruntukan Lesen ini, atau sebahagian daripadanya, tidak boleh dikuatkuasakan untuk sebarang alasan, selebihnya akan terus berkuatkuasa dan berkesan penuh.";
"Part44" = "11. Perjanjian Lengkap; Bahasa yang Menguasai. Lesen ini membentuk keseluruhan perjanjian antara anda dan Apple berkenaan dengan Perisian Apple tersebut, dan menggantikan segala persefahaman sebelum ini atau persefahaman serentak berkenaan perkara sedemikian. Tiada pindaan atau perubahan kepada Lesen ini akan mengikat melainkan pindaan atau perubahan tersebut dibuat secara bertulis dan ditandatangani oleh Apple. Sebarang terjemahan Lesen ini dibuat untuk keperluan tempatan dan dalam keadaan berlakunya suatu pertikaian antara versi Bahasa Inggeris dan versi-versi bukan Bahasa Inggeris, versi Bahasa Inggeris Lesen ini akan menguasai, setakat mana tidak dilarang oleh undang-undang tempatan di bidang kuasa anda.";
"Part45" = "12. Perakuan-perakuan Pihak Ketiga. Sebahagian daripada Perisian Apple tersebut mungkin menggunakan atau termasuk perisian pihak ketiga dan bahan lain yang dilindungi hak cipta. Perakuan-perakuan, terma-terma pelesenan dan penolakan tuntutan-penolakan tuntutan untuk bahan sedemikian adalah terkandung dalam dokumentasi elektronik untuk Perisian Apple tersebut, dan penggunaan bahan sedemikian oleh anda dikuasai mengikut terma-terma tersebut.";
"Part46" = "EA1576";
"Part47" = "16/08/2018";